{"entries":[
{"date":"04/13/2015", "title":"The First Day", "text":"Today I learned about twitter bots written in python. How they intereact with the twitter API using the access keys and what you are able to retrieve from it. Also sending tweets out as well as responding to trending topic tweets. I also learned about setting up a github repository as well as commiting, pushing and pulling from the repository while working with a group. With this you can easily control the source files in a project with the ability to see what has changed from each push in every file."},
{"date":"04/14/2015", "title":"Breaking into booleans", "text":"Today we talked about boolean logic. This includes comparing booleans where they are true, false and also including multiple booleans using OR and AND statements. We worked on a project about a dice rolling game. Two players played a dice game, best of 3. Who ever got two wins first won. If a player rolled a one, they automatically won, but if someone rolled a 2, they got a win taken away from them. If when someone reached 2 wins, the other player had -1 wins, they person with -1 wins automatically won the game. There were 6 different dice to choose from and each time you picked one, it was taken from the list of useable dice. We also disscussed String formating. with this you can make full strings upper or lowercase, as well as replacing or removing characters or words in a string. This also is helpful for printing lines much easier."},
{"date":"04/15/2015", "title":"On your own", "text":"Today we worked some more on projects from yesterday that were incomplete. As I had mine finished, I worked on creating the game of life. In the game of life, you have a grid of \"people\". Each time the \"day\" changes, everyone must be evaluated. If someone has less than 2 neighbors, they die due to under population. If they have 3 or 4 neighbors, they continue to live. If they have more than 4 neighbors they die due to overpopulation. If a place with no living person has 3 neighbors, someone appears there due to repopulation next day. This continues until there is no more living people. I was struggling for a bit with checking for death and repopulation for awhile, until I realized python copies variables by reference unless specified. Because of this I was getting undesired results until I fixed it."},
{"date":"04/16/2015", "title":"Loop de loop", "text":"In class today, we worked on talking about loops, and functions. Loops are idea for shortening tasks that must be completed multiple times in a row with the same data. If we need to print out something 5 times we can make a loop that will run 5 times to complete the task with much less code. Functions are also ideal for shortening code. If we will be doing the same action many times in a program, we can make a function to call that code whenever we happen to need it. This is useful because we don't need to re-write the same thing multiple times. We went back and edited our dice program to include functions and loops to improve the efficiency of the code."},
{"date":"04/17/2015", "title":"Try again", "text":"Try and catches were one of the topics we discussed in class today. With these you are able to run pieces of code that may return an error at one point, such as getting user inputs. If you are trying to turn a users input into an int, you should use a try catch as if they enter a letter or other character, you will get a runtime error. By using the try, we can make sure we are receiving a valid input while converting it to the new type. This is useful for things such as file io, int conversion from strings, as well as many other uses due to the fact that they save the program from crashing."},
{"date":"04/20/2015", "title":"Group together", "text":"Today we started working on a personal project and a group project. Our group project is a twitter streamer that will collect lots of data from specific areas and store it in a mongoDB. With this we will analyze it for common words, tags based on each area. After we analyse the data, we will display it on a website for everyone to see. My personal project is going to be a 2d minecraft game. You will be able to walk around, destroy and build bricks in a 2d environment. This will pose many challenges such as physics, basic ai for enemies as well as map generation. For the first day, I have started with map drawing and simple map generation. Once these are working, I can then move onto physics with the player."},
{"date":"04/21/2015", "title":"Code Reviews", "text":"Today I did a code review on everyones code for the twitter streaming project. I mashed everything together and got it working as intended. I met up with everyone and explained the entire program and answered questions on each part as we went. A few things had to be changed in order to incorporate everyones task, but now it is working. After, I ran it for a while in order to test and gather some tweets. Towards the end of the day, it had gathered around 68,000 tweets. After, I worked on my personal project, doing tests with static and dynamic bodies in order to get a player able to move in the game."},
{"date":"04/22/2015", "title":"It's personal", "text":"Class was spent mostly working on our personal and group projects today. Half way through we talked about improving our image for future job searching. We googled our names and worked on creating a good looking linkedin page. We talked about why these are useful tools when looking for a job as employers often look at these. After that we continued working on our projects. I was able to get moving and jumping finished on my 2d game along with destroying and creating blocks. When you destroy blocks you receive them in your inventory and when you place them you lose them from your inventory. Next I will need to work on displaying your inventory on screen and adding some more features."},
{"date":"04/23/2015", "title":"Grind it out", "text":"Today was a busy day. Everyone had questions about the project we were working on and I did my best to explain what needed to be done. After much discussion we were able to get through all the tasks at hand. Now it is up to me to take all the analysed data and create graphs to represent the data. I found a nice library called pygal that takes data and creates many different types of graphs to represent it. I had some trouble with loading the data back in from the database due to the data not getting structured as I thought it would and mongodb throwing in a random object into the list. I wasn't able to get any work on my personal project, but I am at a point were it would be fine to show off."},
{"date":"04/24/2015", "title":"Final Stretch", "text":"Today was the final stretch for our projects. We presented our personal projects in the middle of the class and explained what we did and how we utilized different libraries to get our task done. After that we finished working on our twitter analyser and I worked on creating graphs from the data we had. After I generated the graphs, I created a HTML page to host all the graphs on my GitHub. Pygal made the graph generation extremely easy and I was able to make alot of graphs to represent all of our data. We also had a small decryption project towards the end as a little end of the week challenge."},
{"date":"04/27/2015", "title":"Pitch day", "text":"Today was pitch day, we were to think up a feature that would be useful within our personal project that hasn't been added yet and pitch the idea along with reasons why it would be worth the time invested in it as if we were a company. I had decided that random terrain would be beneficial as my game is about exploring. We also had some time to work on our projects, and I added in doors and ladders to my project. We then had a pressure challenge to code a program within a certain amount of time. I was able to do it in just under 20 minutes then started to work on an irc bot for fun. The goal of the IRC bot is to be able to place dice games against other people."},
{"date":"04/28/2015", "title":"Ze End", "text":"Today was the last day of our python section. We presented our finalized personal projects and had a mock technical interview. My personal project was looking good with my newly added images and features to bring it to a nice working game. In the mock interview we were asked a few questions about python and then were given a marker board challenge. The challenge is called the Fizz Buzz challenge. If a number is divisible by 3, print fizz, if it is divisible by 5, print buzz, if it is divisible by both, print fizz buzz. After that, we discussed on what our opinions were about the course so far and what we were expecting coming into the class. This ends our 2 weeks of python, and onwards to javascript."},
{"date":"04/29/2015", "title":"Start Anew", "text":"We are starting anew today, and are heading into HTML, CSS and JavaScript. We were tasked to work on 3 labs today that dealt with getting used to HTML and CSS. The first lab was an introduction to HTML, showing how sections, divs and paragraphs effect a HTML page. The second one was to change the page from the last lab to make it match as close as possible to an image provided to us. We had to use styling to make changes such as borders, text color, and font weight. After that we needed to edit a blog template and fill out our information to use as a starter blog that we will end up working on later. After that I did some research about jQuery and what you can do with it as I use it a little bit in one of my personal projects. After getting some info I went on testing to see what worked and didn't work with what I had found."},
{"date":"04/30/2015", "title":"JS Intro", "text":"Today was our start of JavaScript and jQuery. We had a good amount of small labs to do to quickly learn JavaScript. We covered if statements, case statements, while and for loops, as well as arrays and objects. JavaScript has a lot different syntax than Python such as the use of Parenthesis in if/while/for statements, as well as the use of curly braces and semicolons. After I finished up with the labs, I did research on content management systems such as Drupal and Wordpress. I also looked into the limitations of github pages. Later on I looked into AJAX for loading content after the page has been refreshed to fill HTML dynamically. This will be very useful in personal projects of mine that rely heavily on dynamic data that changes alot."},
{"date":"05/1/2015", "title":"Challenge Problems", "text":"Challenge problems were the topic of the day. We had a few using multidimensional arrays were we needed to print specific indexs from those array in a special order. As the arrays were multidimensional we needed multiple indexes to access the things we needed to print out. After this I worked on recoding some PHP for one of my personal websites. I am using MySQL to store data and I am using an object oriented approach to how I handle it. This will take a bit to get all the parts to work together, but it will make adding changes and getting data logs much easier with this sort of structure."},
{"date":"05/4/2015", "title":"A New Challenge", "text":"Today we had a few labs to work on. They dealt with JavaScript functions and form handling. After those we moved into using jQuery in the same labs to see the differences between. Next we did form validation with using jQuery and auto updating when values are entered. The auto updating was calculation ideal values based on one of the entered field. I started on a personal project then which at first will be a WPM calculator, then will evolve into being collaborative programming. This is pose many problems that will need to be solved and should be alot of fun."},
{"date":"05/5/2015", "title":"Getting Started", "text":"Today I started working on my solo projects. I finished the WPM calculating program and gave it a nice looking style. After that I worked on creating a bootstrap based website to hold all the projects I will be creating. Using bootstrap makes it extremely easy to add onto the website and gives me lots of flexibility. Next I started to work on a syntax highlighter. I started off using a hidden textarea and displaying everything in a div right on top of that box, but it ended up posing multiple issues so I decided to go looking for an already existing project. I found CodeMirror and Ace. CodeMirror was nice, but it didn't offer much functionality that I was able to find. Ace is used by lots of places such as github and has all the functionality that I am looking for. Now that I have found that, I am going to be moving on to making collaborative programming. I am planning on using Socket IO to send broadcast messages to the users and will see how that goes."},
{"date":"05/6/2015", "title":"About me", "text":"I have been programming for a good 5 years. I started out working at Target as a Cashier and moved my way up to Customer Service. Shortly after starting there, I got an unpaid internship working at Everfire Studios. While I was there I worked on leading a small team of programmers to create video games. I stay there for alittle over one year before departing from them. At the same time, I was going to school at MATC for computer programming. As I have had previous experience with programming and do it on my free time as well, I became uninterested in school due to the simplicity of classes. After I stopped attending school, I moved onto doing some free lance web development creating two websites. I created on personal website for a game that I had been interested in, as well as one for a friend who had similar interests. I was still liking programming, and decided I should do something about it so I decided to start looking for to go to school again. I found devCodeCamp and have been attending it for four weeks. While I have been here I have worked on many projects. I started with making small edits to an existing Twitter bot. This was to get familiar with Python and progress throughout the program. After that I started making a simple dice rolling game between two players. Once complete, I was tasked with a personal project and a team project. I was the leader in the team project and gave tasks to the team members for the project. We used an agile system to assign and work on the tasks for the single sprint we ended up doing. My personal project was 2D platforming game that utilized mechanics such as block destroying and placing, door opening and ladder climbing to create a world. I have now moved onto learning JavaScript and jQuery. I have created a blog using bootstrap that loads the blog entries via JSON as well as hosting my contact information. In the class we have also had coding challenges, such as trying to make code that is not readable to show why it is necessary to make code readable for other coders. As I am much more experienced then the other people in class, I am working on a side project that will utilized socket io and node.js in order to create a collaborative coding platform. This poses multiple challenges such as networking and multiple users editing the same thing. I hope to work on more team projects going forward to further my experience in working in a team setting, as well as adding some more personal projects under my belt."},
{"date":"05/7/2015", "title":"Collaboration", "text":"Today I worked on my collaborative coding project quite a bit. I have gotten it to were multiple users can code inside of a single document and will receive updates when other users type. They will also receive the most up to date information when connecting to the room. This will save the data to a MySQL database every so often to prevent lost work. I also added the ability to have multiple different documents that users can connect to and use separately that will not share data between them. Towards the end of the day, I decided to add the ability to run JavaScript that is entered into the page to be ran right away for testing. This allows users to test their code while still in the browser. I also worked a little bit on finishing up my blog. I added the ability to search through my posts along with highlighting the searched word in the posts results. I added some fadeIn and fadeOut functions to make the disappearing data on the page look good while going in and out. I had time left to spare, so I looked into Phaser which is a JavaScript game engine. I was able to create a game with physics and block destroying just like what I did with python. There are some functions that differ and do not work how I would like them to, so I would have to do some work around to get block adding into the game. It was a fun experience to see what built in functions they already had in there that make game development much easier."},
{"date":"05/8/2015", "title":"Lets collaborate!", "text":"Today I worked exclusively on my collaboration project. I started the day off by changing the structure of my server sided code a little bit to handle some new features. I added in private and public documents. Users need to be authorized to access private documents and need no access to see a public document. I also added access levels, so documents can require certain levels for certain actions. If they set the requirement of access level 1 for editting, a user will not be able to edit the document at all, but will receive any updates to it. After I finished getting that working, I added functionality to remove a user from the document mid session if their rights are revoked. Once that was complete, I started working on automatic back-ups for the documents. While the users are typing, each document will have a sync value, which determines every how many edits the document is uploaded to the database. The document will back up the last sync every x amount of times it syncs to the database. Automatic backups are a per document basis, so this can be disabled so the document will only have the current document. Each account also has a limit on how many projects they can make and whether or not they can make projects private. I still have a bunch I would like to do and hope to get some more work done next week."}
]}